from PyQt5 import QtCore, QtGui, QtWidgets
import os
import sys
file_1 = open("extra.txt", "a")
file_2 = open("neitral.txt", "a")
file_3 = open("false.txt", "a")
f = open('extra.txt', 'r+')
g = open('neitral.txt', 'r+')
h = open('false.txt', 'r+')



class Ui_MainWindow(object):
    def setupUi(self, MainWindow):
        MainWindow.setObjectName("MainWindow")
        MainWindow.resize(1104, 730)
        MainWindow.setStyleSheet("background-color: rgb(95, 94, 123);")
        self.centralwidget = QtWidgets.QWidget(MainWindow)
        self.centralwidget.setObjectName("centralwidget")
        self.label = QtWidgets.QLabel(self.centralwidget)
        self.label.setGeometry(QtCore.QRect(6, 2, 1091, 421))
        font = QtGui.QFont()
        font.setPointSize(11)
        self.label.setFont(font)
        self.label.setStyleSheet("background-color: rgb(73, 89, 123);\n"
"color: rgb(255, 255, 255);")
        self.label.setText("")
        self.label.setObjectName("label")
        self.pushButton = QtWidgets.QPushButton(self.centralwidget)
        self.pushButton.setGeometry(QtCore.QRect(480, 610, 151, 61))
        self.pushButton.setStyleSheet("background-color: rgb(73, 89, 123);\n"
"color: rgb(255, 255, 255);")
        self.pushButton.setObjectName("pushButton")
        self.label_2 = QtWidgets.QLabel(self.centralwidget)
        self.label_2.setGeometry(QtCore.QRect(420, 510, 141, 31))
        font = QtGui.QFont()
        font.setPointSize(10)
        self.label_2.setFont(font)
        self.label_2.setStyleSheet("background-color: rgb(73, 89, 123);\n"
"color: rgb(255, 255, 255);")
        self.label_2.setObjectName("label_2")
        self.label_3 = QtWidgets.QLabel(self.centralwidget)
        self.label_3.setGeometry(QtCore.QRect(420, 540, 141, 31))
        font = QtGui.QFont()
        font.setPointSize(10)
        self.label_3.setFont(font)
        self.label_3.setStyleSheet("background-color: rgb(73, 89, 123);\n"
"color: rgb(255, 255, 255);")
        self.label_3.setObjectName("label_3")
        self.label_4 = QtWidgets.QLabel(self.centralwidget)
        self.label_4.setGeometry(QtCore.QRect(420, 570, 141, 31))
        font = QtGui.QFont()
        font.setPointSize(10)
        self.label_4.setFont(font)
        self.label_4.setStyleSheet("background-color: rgb(73, 89, 123);\n"
"color: rgb(255, 255, 255);")
        self.label_4.setObjectName("label_4")
        self.extra = QtWidgets.QLabel(self.centralwidget)
        self.extra.setGeometry(QtCore.QRect(560, 510, 131, 31))
        font = QtGui.QFont()
        font.setPointSize(10)
        self.extra.setFont(font)
        self.extra.setStyleSheet("background-color: rgb(73, 89, 123);\n"
"color: rgb(255, 255, 255);")
        self.extra.setText("")
        self.extra.setObjectName("extra")
        self.neitral = QtWidgets.QLabel(self.centralwidget)
        self.neitral.setGeometry(QtCore.QRect(560, 540, 131, 31))
        font = QtGui.QFont()
        font.setPointSize(10)
        self.neitral.setFont(font)
        self.neitral.setStyleSheet("background-color: rgb(73, 89, 123);\n"
"color: rgb(255, 255, 255);")
        self.neitral.setText("")
        self.neitral.setObjectName("neitral")
        self.false_2 = QtWidgets.QLabel(self.centralwidget)
        self.false_2.setGeometry(QtCore.QRect(560, 570, 131, 31))
        font = QtGui.QFont()
        font.setPointSize(10)
        self.false_2.setFont(font)
        self.false_2.setStyleSheet("background-color: rgb(73, 89, 123);\n"
"color: rgb(255, 255, 255);")
        self.false_2.setText("")
        self.false_2.setObjectName("false_2")
        MainWindow.setCentralWidget(self.centralwidget)
        self.menubar = QtWidgets.QMenuBar(MainWindow)
        self.menubar.setGeometry(QtCore.QRect(0, 0, 1104, 21))
        self.menubar.setObjectName("menubar")
        MainWindow.setMenuBar(self.menubar)
        self.statusbar = QtWidgets.QStatusBar(MainWindow)
        self.statusbar.setObjectName("statusbar")
        MainWindow.setStatusBar(self.statusbar)

        self.retranslateUi(MainWindow)
        QtCore.QMetaObject.connectSlotsByName(MainWindow)



        with open("extra.txt") as file:
            int_number = file.read()
            itogballextra = eval(int_number)

        with open("neitral.txt") as file1:
            int_number1 = file1.read()
            itogballneitral = eval(int_number1)

        with open("false.txt") as file2:
            int_number2 = file2.read()
            itogballfalse = eval(int_number2)

        self.extra.setText(str(itogballextra))
        self.neitral.setText(str(itogballneitral))
        self.false_2.setText(str(itogballfalse))

        if itogballfalse > 4:
            self.label.setText("ВЫ БЫЛИ НЕ ИСКРЕНИ В ОТВЕТАХ.")
        if itogballfalse <= 4:
            if itogballextra >= itogballneitral:
                if itogballextra > 19:
                    self.label.setText("ВЫ ЯРКИЙ ЭКСТРАВЕРТ.\nЭкстраверсия — интроверсия Характеризуя типичного экстраверта, автор отмечает его общительность и обращенность индивида вовне,\n широкий круг знакомств, необходимость в контактах. Он действует под влиянием момента, ипульсивен, вспыльчив, беззаботен,\n оптимистичен,добродушен, весел. Предпочитает движение и действие, имеет тенденцию к агрессивности. Чувства и эмоции не имеют\n строгого контроля,склонен к рискованным поступкам. На него не всегда можно положиться. Типичный интроверт — это спокойный,\n застенчивый, интроективный человек,склонный к самоанализу. Сдержан и отдален от всех, кроме близких друзей. Планирует и \n обдумывает свои действия заранее, не доверяет внезапным побуждениям серьезно относится к принятию решений, любит во всем \n порядок. Контролирует свои чувства, его нелегко вывести из себя. Обладает пессимистичностью, высоко ценит нравственные нормы.\n Нейротизм Характеризует эмоциональную устойчивость или неустойчивость (эмоциональная стабильность или нестабильность). ")
                elif itogballextra >=15 and itogballextra <=19 :
                    self.label.setText("ВЫ ЭКСТРАВЕРТ.\nЭкстраверсия — интроверсия Характеризуя типичного экстраверта, автор отмечает его общительность и обращенность индивида вовне,\n широкий круг знакомств, необходимость в контактах. Он действует под влиянием момента, ипульсивен, вспыльчив, беззаботен,\n оптимистичен,добродушен, весел. Предпочитает движение и действие, имеет тенденцию к агрессивности. Чувства и эмоции не имеют\n строгого контроля,склонен к рискованным поступкам. На него не всегда можно положиться. Типичный интроверт — это спокойный,\n застенчивый, интроективный человек,склонный к самоанализу. Сдержан и отдален от всех, кроме близких друзей. Планирует и \n обдумывает свои действия заранее, не доверяет внезапным побуждениям серьезно относится к принятию решений, любит во всем \n порядок. Контролирует свои чувства, его нелегко вывести из себя. Обладает пессимистичностью, высоко ценит нравственные нормы.\n Нейротизм Характеризует эмоциональную устойчивость или неустойчивость (эмоциональная стабильность или нестабильность). ")
                elif itogballextra >12 and itogballextra <15:
                    self.label.setText("У ВАС СКЛОННОСТЬ К ЭКСТРАВЕРСИИ.\nЭкстраверсия — интроверсия Характеризуя типичного экстраверта, автор отмечает его общительность и обращенность индивида вовне,\n широкий круг знакомств, необходимость в контактах. Он действует под влиянием момента, ипульсивен, вспыльчив, беззаботен,\n оптимистичен,добродушен, весел. Предпочитает движение и действие, имеет тенденцию к агрессивности. Чувства и эмоции не имеют\n строгого контроля,склонен к рискованным поступкам. На него не всегда можно положиться. Типичный интроверт — это спокойный,\n застенчивый, интроективный человек,склонный к самоанализу. Сдержан и отдален от всех, кроме близких друзей. Планирует и \n обдумывает свои действия заранее, не доверяет внезапным побуждениям серьезно относится к принятию решений, любит во всем \n порядок. Контролирует свои чувства, его нелегко вывести из себя. Обладает пессимистичностью, высоко ценит нравственные нормы.\n Нейротизм Характеризует эмоциональную устойчивость или неустойчивость (эмоциональная стабильность или нестабильность). ")
                elif itogballextra == 12 :
                    self.label.setText("У ВАС СРЕДНЕЕ ЗНАЧЕНИЕ ЭКСТРАВЕРСИИ.\nЭкстраверсия — интроверсия Характеризуя типичного экстраверта, автор отмечает его общительность и обращенность индивида вовне,\n широкий круг знакомств, необходимость в контактах. Он действует под влиянием момента, ипульсивен, вспыльчив, беззаботен,\n оптимистичен,добродушен, весел. Предпочитает движение и действие, имеет тенденцию к агрессивности. Чувства и эмоции не имеют\n строгого контроля,склонен к рискованным поступкам. На него не всегда можно положиться. Типичный интроверт — это спокойный,\n застенчивый, интроективный человек,склонный к самоанализу. Сдержан и отдален от всех, кроме близких друзей. Планирует и \n обдумывает свои действия заранее, не доверяет внезапным побуждениям серьезно относится к принятию решений, любит во всем \n порядок. Контролирует свои чувства, его нелегко вывести из себя. Обладает пессимистичностью, высоко ценит нравственные нормы.\n Нейротизм Характеризует эмоциональную устойчивость или неустойчивость (эмоциональная стабильность или нестабильность). ")
                elif itogballextra <12 and itogballextra >= 9:
                    self.label.setText("У ВАС СКЛОННОСТЬ К ИНТРОВЕРСИИ.\nЭкстраверсия — интроверсия Характеризуя типичного экстраверта, автор отмечает его общительность и обращенность индивида вовне,\n широкий круг знакомств, необходимость в контактах. Он действует под влиянием момента, ипульсивен, вспыльчив, беззаботен,\n оптимистичен,добродушен, весел. Предпочитает движение и действие, имеет тенденцию к агрессивности. Чувства и эмоции не имеют\n строгого контроля,склонен к рискованным поступкам. На него не всегда можно положиться. Типичный интроверт — это спокойный,\n застенчивый, интроективный человек,склонный к самоанализу. Сдержан и отдален от всех, кроме близких друзей. Планирует и \n обдумывает свои действия заранее, не доверяет внезапным побуждениям серьезно относится к принятию решений, любит во всем \n порядок. Контролирует свои чувства, его нелегко вывести из себя. Обладает пессимистичностью, высоко ценит нравственные нормы.\n Нейротизм Характеризует эмоциональную устойчивость или неустойчивость (эмоциональная стабильность или нестабильность). ")
                elif itogballextra <9 and itogballextra >= 5 :
                    self.label.setText("ВЫ ИНТРОВЕРТ.\nЭкстраверсия — интроверсия Характеризуя типичного экстраверта, автор отмечает его общительность и обращенность индивида вовне,\n широкий круг знакомств, необходимость в контактах. Он действует под влиянием момента, ипульсивен, вспыльчив, беззаботен,\n оптимистичен,добродушен, весел. Предпочитает движение и действие, имеет тенденцию к агрессивности. Чувства и эмоции не имеют\n строгого контроля,склонен к рискованным поступкам. На него не всегда можно положиться. Типичный интроверт — это спокойный,\n застенчивый, интроективный человек,склонный к самоанализу. Сдержан и отдален от всех, кроме близких друзей. Планирует и \n обдумывает свои действия заранее, не доверяет внезапным побуждениям серьезно относится к принятию решений, любит во всем \n порядок. Контролирует свои чувства, его нелегко вывести из себя. Обладает пессимистичностью, высоко ценит нравственные нормы.\n Нейротизм Характеризует эмоциональную устойчивость или неустойчивость (эмоциональная стабильность или нестабильность). ")
                elif itogballextra < 5:
                    self.label.setText("ВЫ ГЛУБОКИЙ ИНТРОВЕРТ.\nЭкстраверсия — интроверсия Характеризуя типичного экстраверта, автор отмечает его общительность и обращенность индивида вовне,\n широкий круг знакомств, необходимость в контактах. Он действует под влиянием момента, ипульсивен, вспыльчив, беззаботен,\n оптимистичен,добродушен, весел. Предпочитает движение и действие, имеет тенденцию к агрессивности. Чувства и эмоции не имеют\n строгого контроля,склонен к рискованным поступкам. На него не всегда можно положиться. Типичный интроверт — это спокойный,\n застенчивый, интроективный человек,склонный к самоанализу. Сдержан и отдален от всех, кроме близких друзей. Планирует и \n обдумывает свои действия заранее, не доверяет внезапным побуждениям серьезно относится к принятию решений, любит во всем \n порядок. Контролирует свои чувства, его нелегко вывести из себя. Обладает пессимистичностью, высоко ценит нравственные нормы.\n Нейротизм Характеризует эмоциональную устойчивость или неустойчивость (эмоциональная стабильность или нестабильность). ")
            elif itogballneitral > itogballextra:

                if itogballneitral >19:
                    self.label.setText("У ВАС ОЧЕНЬ ВЫСОКИЙ УРОВЕНЬ НЕЙТРОЛИЗМА \nНейротизм, по некоторым данным, связан с показателями лабильности нервной системы. Эмоциональная устойчивость — черта,\n выражающая сохранение организованного поведения, ситуативной целенаправленности в обычных и стрессовых ситуациях.\n Характеризуется зрелостью, отличной адаптацией, отсутствием большой напряженности, беспокойства, а также склонностью\n к лидерству, общительности. Нейротизм выражается в чрезвычайной нервности, неустойчивости, плохой адаптации, склонности\n к быстрой смене настроений (лабильности), чувстве виновности и беспокойства, озабоченности, депрессивных реакциях,\n рассеянности внимания, неустойчивости в стрессовых ситуациях. Нейротизму соответствует эмоциональность,импульсивность;\n неровность в контактах с людьми, изменчивость интересов, неуверенность в себе, выраженная чувствительность,\n впечатлительность, склонность к раздражительности. Нейротическая личность характеризуется неадекватно сильными реакциями\n по отношению к вызывающим их стимулам. У лиц с высокими показателями по шкале нейротизма\n в неблагоприятных стрессовых ситуациях может развиться невроз.")
                elif itogballneitral > 13 and itogballneitral <= 19:
                    self.label.setText("У ВАС ВЫСОКИЙ УРОВЕНЬ НЕЙТРОЛИЗМА \nНейротизм, по некоторым данным, связан с показателями лабильности нервной системы. Эмоциональная устойчивость — черта,\n выражающая сохранение организованного поведения, ситуативной целенаправленности в обычных и стрессовых ситуациях.\n Характеризуется зрелостью, отличной адаптацией, отсутствием большой напряженности, беспокойства, а также склонностью\n к лидерству, общительности. Нейротизм выражается в чрезвычайной нервности, неустойчивости, плохой адаптации, склонности\n к быстрой смене настроений (лабильности), чувстве виновности и беспокойства, озабоченности, депрессивных реакциях,\n рассеянности внимания, неустойчивости в стрессовых ситуациях. Нейротизму соответствует эмоциональность,импульсивность;\n неровность в контактах с людьми, изменчивость интересов, неуверенность в себе, выраженная чувствительность,\n впечатлительность, склонность к раздражительности. Нейротическая личность характеризуется неадекватно сильными реакциями\n по отношению к вызывающим их стимулам. У лиц с высокими показателями по шкале нейротизма\n в неблагоприятных стрессовых ситуациях может развиться невроз.")
                elif itogballneitral >= 9 and itogballneitral <= 13:
                    self.label.setText("У ВАС СРЕДНЕЕ ЗНАЧЕНИЕ НЕЙТРОЛИЗМА \nНейротизм, по некоторым данным, связан с показателями лабильности нервной системы. Эмоциональная устойчивость — черта,\n выражающая сохранение организованного поведения, ситуативной целенаправленности в обычных и стрессовых ситуациях.\n Характеризуется зрелостью, отличной адаптацией, отсутствием большой напряженности, беспокойства, а также склонностью\n к лидерству, общительности. Нейротизм выражается в чрезвычайной нервности, неустойчивости, плохой адаптации, склонности\n к быстрой смене настроений (лабильности), чувстве виновности и беспокойства, озабоченности, депрессивных реакциях,\n рассеянности внимания, неустойчивости в стрессовых ситуациях. Нейротизму соответствует эмоциональность,импульсивность;\n неровность в контактах с людьми, изменчивость интересов, неуверенность в себе, выраженная чувствительность,\n впечатлительность, склонность к раздражительности. Нейротическая личность характеризуется неадекватно сильными реакциями\n по отношению к вызывающим их стимулам. У лиц с высокими показателями по шкале нейротизма\n в неблагоприятных стрессовых ситуациях может развиться невроз.")
                elif itogballneitral < 9:
                    self.label.setText("У НИЗКИЙ УРОВЕНЬ НЕЙТРОЛИЗМА \nНейротизм, по некоторым данным, связан с показателями лабильности нервной системы. Эмоциональная устойчивость — черта,\n выражающая сохранение организованного поведения, ситуативной целенаправленности в обычных и стрессовых ситуациях.\n Характеризуется зрелостью, отличной адаптацией, отсутствием большой напряженности, беспокойства, а также склонностью\n к лидерству, общительности. Нейротизм выражается в чрезвычайной нервности, неустойчивости, плохой адаптации, склонности\n к быстрой смене настроений (лабильности), чувстве виновности и беспокойства, озабоченности, депрессивных реакциях,\n рассеянности внимания, неустойчивости в стрессовых ситуациях. Нейротизму соответствует эмоциональность,импульсивность;\n неровность в контактах с людьми, изменчивость интересов, неуверенность в себе, выраженная чувствительность,\n впечатлительность, склонность к раздражительности. Нейротическая личность характеризуется неадекватно сильными реакциями\n по отношению к вызывающим их стимулам. У лиц с высокими показателями по шкале нейротизма\n в неблагоприятных стрессовых ситуациях может развиться невроз.")



        self.functional()

    def functional(self):
        self.pushButton.clicked.connect(self.close)

    def close(self):
        f.truncate(0)
        g.truncate(0)
        h.truncate(0)
        sys.exit()






    def retranslateUi(self, MainWindow):
        _translate = QtCore.QCoreApplication.translate
        MainWindow.setWindowTitle(_translate("MainWindow", "Итог тестирования"))
        self.label.setText(_translate("MainWindow", "TextLabel"))
        self.pushButton.setText(_translate("MainWindow", "Завершить"))
        self.label_2.setText(_translate("MainWindow", "Ваш бал экстраверта"))
        self.label_3.setText(_translate("MainWindow", "Ваш бал нейтролизма"))
        self.label_4.setText(_translate("MainWindow", "Ваш бал лжи"))

if __name__ == "__main__":
    import sys
    app = QtWidgets.QApplication(sys.argv)
    MainWindow = QtWidgets.QMainWindow()
    ui = Ui_MainWindow()
    ui.setupUi(MainWindow)
    MainWindow.show()
    sys.exit(app.exec_())